{
  "broadArea": {
    "name": "Biotechnology and Biomedical Engineering",
    "link": "https://www.vlab.co.in/broad-area-biotechnology-and-biomedical-engineering",
    "code": "BIO"
  },
  "lab": "Biochemistry Virtual Lab",
  "lab_display_name": "Biochemistry Virtual Lab",
  "phase": "3-ext",
  "collegeName": "DLBG",
  "baseUrl": "biochem-dei.vlabs.ac.in",
  "introduction": "Biochemistry is the study of the chemical processes that occur within and support living organisms. It merges principles from chemistry and biology to explore the structure, function, and interactions of biological molecules such as proteins, nucleic acids, lipids, and carbohydrates. Understanding these molecules and their behavior is essential for interpreting fundamental life processes, diagnosing diseases, and developing therapeutic strategies.<br>This Biochemistry Virtual Lab is designed to provide students with an interactive and experiential learning environment that simulates real laboratory techniques and analyses. Through a suite of virtual experiments, learners will gain practical insights into core biochemical concepts and methods, including the analysis of macromolecules, enzymatic activity, buffer preparation, and physicochemical properties of biomolecules. Each module replicates essential laboratory procedures in a virtual format, allowing users to perform experiments, collect data, and interpret results without the constraints of a physical lab.<br>The experiments included in this virtual lab cover a comprehensive range of topics: from qualitative and quantitative assessment of fats and sugars to molecular estimations of DNA, RNA, and proteins, as well as enzyme kinetics and buffer systems. By completing these modules, students will reinforce theoretical knowledge through simulated practice, enhance analytical thinking, and develop a foundational understanding of experimental biochemistry.",
  "experiments":[
  {
    "name": "Analyze Quality and Quantity of Fats",
    "short-name": "quantity-of-fats",
    "repo": "https://github.com/virtual-labs/exp-quantity-of-fats-dei",
    "tag": "v1.0.1",
    "deploy": true
  },
  {
    "name": "Analyze Quality and Quantity of DNA and RNA",
    "short-name": "dna-rna-analysis",
    "repo": "https://github.com/virtual-labs/exp-dna-rna-dei",
    "tag": "v1.0.1",
    "deploy": true
  },
  {
    "name": "Quantitative Estimation of Proteins",
    "short-name": "protein-estimation",
    "repo": "https://github.com/virtual-labs/exp-estimation-of-proteins-dei",
    "tag": "v1.0.1",
    "deploy": true
  },
  {
    "name": "Estimate Lysozyme Enzymatic Activity and Determination of Km and Vmax",
    "short-name": "km-vmax",
    "repo": "https://github.com/virtual-labs/exp-km-vmax-dei",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Quantitative Estimation of Sugar from a Given Sample",
    "short-name": "sugar-estimation",
    "repo": "https://github.com/virtual-labs/exp-estimation-of-sugar-dei",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Preparation of Phosphate Buffer and Carbonate-Bicarbonate Buffer",
    "short-name": "buffer-preparation",
    "repo": "https://github.com/virtual-labs/exp-phosphate-carbonate-bicarbonate-dei",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Determination of pKa Values",
    "short-name": "pka-values",
    "repo": "https://github.com/virtual-labs/exp-pka-values-dei",
    "tag": "v1.0.0",
    "deploy": true
  }
  ],

  "targetAudience": {
   "UG": [ "The lab is intended for UG and PG engineering students, faculty members, research scholars, and industry trainees."
                ],
                "PG": [
                    "The lab is intended for UG and PG engineering students, faculty members, research scholars, and industry trainees."
                ]
            },
  "objective": "The primary objectives of the Biochemistry Virtual Lab are:<ul><li>To familiarize students with fundamental biochemical laboratory techniques and methodologies in a simulated environment.</li><li>To enable learners to qualitatively and quantitatively analyze biological macromolecules such as fats, proteins, nucleic acids, and sugars.</li><li>To provide practical understanding of enzyme activity measurement and kinetic parameters (Km and Vmax) through virtual experimentation with lysozyme.</li><li>To guide students through the preparation and application of common biochemical buffers, including phosphate and carbonate-bicarbonate buffers.</li><li>To illustrate how physicochemical properties (e.g., pKa values) of biomolecules influence their behavior and function.</li><li>To strengthen data interpretation skills by having students collect virtual experimental data, perform calculations, and draw conclusions.</li><li>To create an accessible, safe, and repeatable learning environment that supports self-paced exploration of core concepts in biochemistry.</li></ul>",
  "courseAlignment": {
    "description": "The Virtual Biochemistry Laboratory is designed to cater to a broad, inclusive learner base, in alignment with UGC, NAAC, and NEP-2020 guidelines. The target audience includes:",
    "universities": [
      "Undergraduate Level(UG) B.Sc. students in Biochemistry, Biotechnology, Zoology, Botany, Microbiology, Life Sciences, Biomedical Sciences, Nutrition, and Allied Disciplines",
      "Learners in early semesters requiring foundational exposure to biochemical laboratory techniques",
      "Institutions with limited physical laboratory infrastructure",
      "Purpose at UG Level:Develop conceptual understanding of biomolecules",
      "Introduce basic biochemical techniques",
      "Develop data interpretation and laboratory readiness",
      "Postgraduate Level (PG) M.Sc. students in Biochemistry and Allied Life Sciences",
      "Learners requiring revision or reinforcement of core biochemical practical skills",
      "Students preparing for advanced laboratory courses or dissertations",
      "Purpose at PG Level:Strengthen analytical and interpretative skills",
      "Reinforce experimental design concepts",
      "Bridge theory with advanced biochemical applications"
    ]
  }
 
}
